server/tests/k6-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

running (0m12.0s), 05/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  01.0s/50.0s

running (0m13.0s), 10/50 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10/50 VUs  02.0s/50.0s

running (0m14.0s), 15/50 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 15/50 VUs  03.0s/50.0s

running (0m15.0s), 20/50 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 20/50 VUs  04.0s/50.0s

running (0m16.0s), 25/50 VUs, 5 complete and 0 interrupted iterations
default   [  10% ] 25/50 VUs  05.0s/50.0s

running (0m17.0s), 30/50 VUs, 10 complete and 0 interrupted iterations
default   [  12% ] 30/50 VUs  06.0s/50.0s

running (0m18.0s), 35/50 VUs, 15 complete and 0 interrupted iterations
default   [  14% ] 35/50 VUs  07.0s/50.0s

running (0m19.0s), 40/50 VUs, 20 complete and 0 interrupted iterations
default   [  16% ] 40/50 VUs  08.0s/50.0s

running (0m20.0s), 45/50 VUs, 30 complete and 0 interrupted iterations
default   [  18% ] 45/50 VUs  09.0s/50.0s

running (0m21.0s), 49/50 VUs, 40 complete and 0 interrupted iterations
default   [  20% ] 49/50 VUs  10.0s/50.0s

running (0m22.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  11.0s/50.0s

running (0m23.0s), 50/50 VUs, 60 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  12.0s/50.0s

running (0m24.0s), 50/50 VUs, 74 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  13.0s/50.0s

running (0m25.0s), 50/50 VUs, 89 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  14.0s/50.0s

running (0m26.0s), 50/50 VUs, 99 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  15.0s/50.0s

running (0m27.0s), 50/50 VUs, 109 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  16.0s/50.0s

running (0m28.0s), 50/50 VUs, 124 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  17.0s/50.0s

running (0m29.0s), 50/50 VUs, 138 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  18.0s/50.0s

running (0m30.0s), 50/50 VUs, 149 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  19.0s/50.0s

running (0m31.0s), 50/50 VUs, 159 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  20.0s/50.0s

running (0m32.0s), 50/50 VUs, 174 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  21.0s/50.0s

running (0m33.0s), 50/50 VUs, 188 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  22.0s/50.0s

running (0m34.0s), 50/50 VUs, 198 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  23.0s/50.0s

running (0m35.0s), 50/50 VUs, 208 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  24.0s/50.0s

running (0m36.0s), 50/50 VUs, 223 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  25.0s/50.0s

running (0m37.0s), 50/50 VUs, 238 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  26.0s/50.0s

running (0m38.0s), 50/50 VUs, 248 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  27.0s/50.0s

running (0m39.0s), 50/50 VUs, 258 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  28.0s/50.0s

running (0m40.0s), 50/50 VUs, 272 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  29.0s/50.0s

running (0m41.0s), 50/50 VUs, 287 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  30.0s/50.0s

running (0m42.0s), 50/50 VUs, 298 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  31.0s/50.0s

running (0m43.0s), 50/50 VUs, 308 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  32.0s/50.0s

running (0m44.0s), 50/50 VUs, 322 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  33.0s/50.0s

running (0m45.0s), 50/50 VUs, 337 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  34.0s/50.0s

running (0m46.0s), 50/50 VUs, 348 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  35.0s/50.0s

running (0m47.0s), 50/50 VUs, 358 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  36.0s/50.0s

running (0m48.0s), 50/50 VUs, 372 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  37.0s/50.0s

running (0m49.0s), 50/50 VUs, 387 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  38.0s/50.0s

running (0m50.0s), 50/50 VUs, 398 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  39.0s/50.0s

running (0m51.0s), 50/50 VUs, 408 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  40.0s/50.0s

running (0m52.0s), 50/50 VUs, 422 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  41.0s/50.0s

running (0m53.0s), 46/50 VUs, 437 complete and 0 interrupted iterations
default   [  84% ] 46/50 VUs  42.0s/50.0s

running (0m54.0s), 45/50 VUs, 448 complete and 0 interrupted iterations
default   [  86% ] 45/50 VUs  43.0s/50.0s

running (0m55.0s), 41/50 VUs, 458 complete and 0 interrupted iterations
default   [  88% ] 41/50 VUs  44.0s/50.0s

running (0m56.0s), 36/50 VUs, 472 complete and 0 interrupted iterations
default   [  90% ] 36/50 VUs  45.0s/50.0s

running (0m57.0s), 31/50 VUs, 483 complete and 0 interrupted iterations
default   [  92% ] 31/50 VUs  46.0s/50.0s

running (0m58.0s), 26/50 VUs, 493 complete and 0 interrupted iterations
default   [  94% ] 26/50 VUs  47.0s/50.0s

running (0m59.0s), 21/50 VUs, 499 complete and 0 interrupted iterations
default   [  96% ] 21/50 VUs  48.0s/50.0s

running (1m00.0s), 16/50 VUs, 508 complete and 0 interrupted iterations
default   [  98% ] 16/50 VUs  49.0s/50.0s

running (1m01.0s), 11/50 VUs, 514 complete and 0 interrupted iterations
default   [ 100% ] 11/50 VUs  50.0s/50.0s

running (1m02.0s), 06/50 VUs, 519 complete and 0 interrupted iterations
default ↓ [ 100% ] 11/50 VUs  50s

running (1m03.0s), 05/50 VUs, 520 complete and 0 interrupted iterations
default ↓ [ 100% ] 11/50 VUs  50s

running (1m04.0s), 01/50 VUs, 524 complete and 0 interrupted iterations
default ↓ [ 100% ] 11/50 VUs  50s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=7.23ms

    http_req_failed
    ✗ 'rate<0.01' rate=78.50%


  █ TOTAL RESULTS 

    checks_total.......: 2625   40.934494/s
    checks_succeeded...: 20.00% 525 out of 2625
    checks_failed......: 80.00% 2100 out of 2625

    ✓ status is 200
    ✗ library add is 201
      ↳  0% — ✓ 0 / ✗ 525
    ✗ library fetch is 200
      ↳  0% — ✓ 0 / ✗ 525
    ✗ progress report is 200
      ↳  0% — ✓ 0 / ✗ 525
    ✗ continue watching fetch is 200
      ↳  0% — ✓ 0 / ✗ 525

    HTTP
    http_req_duration..............: avg=7.88ms  min=540µs med=3.85ms max=247.31ms p(90)=6.27ms p(95)=7.23ms  
      { expected_response:true }...: avg=20.98ms min=540µs med=1.91ms max=247.31ms p(90)=5.42ms p(95)=217.24ms
    http_req_failed................: 78.50% 2100 out of 2675
    http_reqs......................: 2675   41.714199/s

    EXECUTION
    iteration_duration.............: avg=4.02s   min=4.01s med=4.02s  max=4.04s    p(90)=4.02s  p(95)=4.02s   
    iterations.....................: 525    8.186899/s
    vus............................: 1      min=0            max=50
    vus_max........................: 50     min=50           max=50

    NETWORK
    data_received..................: 3.1 MB 49 kB/s
    data_sent......................: 1.0 MB 16 kB/s



running (1m04.1s), 00/50 VUs, 525 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  50s
time="2026-02-25T22:11:07+01:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"